trol73/avr-make/asm/include/ATxmega128A1Udef.inc
.equ TWIF_CTRL = 1200		// TWI Common Control Register
.equ TWIF_MASTER_CTRLA = 1201		// Control Register A
.equ TWIF_MASTER_CTRLB = 1202		// Control Register B
.equ TWIF_MASTER_CTRLC = 1203		// Control Register C
.equ TWIF_MASTER_STATUS = 1204		// Status Register
.equ TWIF_MASTER_BAUD = 1205		// Baurd Rate Control Register
.equ TWIF_MASTER_ADDR = 1206		// Address Register
.equ TWIF_MASTER_DATA = 1207		// Data Register
.equ TWIF_SLAVE_CTRLA = 1208		// Control Register A
.equ TWIF_SLAVE_CTRLB = 1209		// Control Register B
.equ TWIF_SLAVE_STATUS = 1210		// Status Register
.equ TWIF_SLAVE_ADDR = 1211		// Address Register
.equ TWIF_SLAVE_DATA = 1212		// Data Register
.equ TWIF_SLAVE_ADDRMASK = 1213		// Address Mask Register

;***************************************************************************
;** USB - Universal Serial Bus
;***************************************************************************
	
.equ USB_CTRLA = 1216		// Control Register A
.equ USB_CTRLB = 1217		// Control Register B
.equ USB_STATUS = 1218		// Status Register
.equ USB_ADDR = 1219		// Address Register
.equ USB_FIFOWP = 1220		// FIFO Write Pointer Register
.equ USB_FIFORP = 1221		// FIFO Read Pointer Register
.equ USB_EPPTR = 1222		// Endpoint Configuration Table Pointer
.equ USB_INTCTRLA = 1224		// Interrupt Control Register A
.equ USB_INTCTRLB = 1225		// Interrupt Control Register B
.equ USB_INTFLAGSACLR = 1226		// Clear Interrupt Flag Register A
.equ USB_INTFLAGSASET = 1227		// Set Interrupt Flag Register A
.equ USB_INTFLAGSBCLR = 1228		// Clear Interrupt Flag Register B
.equ USB_INTFLAGSBSET = 1229		// Set Interrupt Flag Register B
.equ USB_CAL0 = 1274		// Calibration Byte 0
.equ USB_CAL1 = 1275		// Calibration Byte 1

;***************************************************************************
;** PORTA - Port A
;***************************************************************************
	
.equ PORTA_DIR = 1536		// I/O Port Data Direction
.equ PORTA_DIRSET = 1537		// I/O Port Data Direction Set
.equ PORTA_DIRCLR = 1538		// I/O Port Data Direction Clear
.equ PORTA_DIRTGL = 1539		// I/O Port Data Direction Toggle
.equ PORTA_OUT = 1540		// I/O Port Output
.equ PORTA_OUTSET = 1541		// I/O Port Output Set
.equ PORTA_OUTCLR = 1542		// I/O Port Output Clear
.equ PORTA_OUTTGL = 1543		// I/O Port Output Toggle
.equ PORTA_IN = 1544		// I/O port Input
.equ PORTA_INTCTRL = 1545		// Interrupt Control Register
.equ PORTA_INT0MASK = 1546		// Port Interrupt 0 Mask
.equ PORTA_INT1MASK = 1547		// Port Interrupt 1 Mask
.equ PORTA_INTFLAGS = 1548		// Interrupt Flag Register
.equ PORTA_REMAP = 1550		// I/O Port Pin Remap Register
.equ PORTA_PIN0CTRL = 1552		// Pin 0 Control Register
.equ PORTA_PIN1CTRL = 1553		// Pin 1 Control Register
.equ PORTA_PIN2CTRL = 1554		// Pin 2 Control Register
.equ PORTA_PIN3CTRL = 1555		// Pin 3 Control Register
.equ PORTA_PIN4CTRL = 1556		// Pin 4 Control Register
.equ PORTA_PIN5CTRL = 1557		// Pin 5 Control Register
.equ PORTA_PIN6CTRL = 1558		// Pin 6 Control Register
.equ PORTA_PIN7CTRL = 1559		// Pin 7 Control Register

;***************************************************************************
;** PORTB - Port B
;***************************************************************************
	
.equ PORTB_DIR = 1568		// I/O Port Data Direction
.equ PORTB_DIRSET = 1569		// I/O Port Data Direction Set
.equ PORTB_DIRCLR = 1570		// I/O Port Data Direction Clear
.equ PORTB_DIRTGL = 1571		// I/O Port Data Direction Toggle
.equ PORTB_OUT = 1572		// I/O Port Output
.equ PORTB_OUTSET = 1573		// I/O Port Output Set
.equ PORTB_OUTCLR = 1574		// I/O Port Output Clear
.equ PORTB_OUTTGL = 1575		// I/O Port Output Toggle
.equ PORTB_IN = 1576		// I/O port Input
.equ PORTB_INTCTRL = 1577		// Interrupt Control Register
.equ PORTB_INT0MASK = 1578		// Port Interrupt 0 Mask
.equ PORTB_INT1MASK = 1579		// Port Interrupt 1 Mask
.equ PORTB_INTFLAGS = 1580		// Interrupt Flag Register
.equ PORTB_REMAP = 1582		// I/O Port Pin Remap Register
.equ PORTB_PIN0CTRL = 1584		// Pin 0 Control Register
.equ PORTB_PIN1CTRL = 1585		// Pin 1 Control Register
.equ PORTB_PIN2CTRL = 1586		// Pin 2 Control Register
.equ PORTB_PIN3CTRL = 1587		// Pin 3 Control Register
.equ PORTB_PIN4CTRL = 1588		// Pin 4 Control Register
.equ PORTB_PIN5CTRL = 1589		// Pin 5 Control Register
.equ PORTB_PIN6CTRL = 1590		// Pin 6 Control Register
.equ PORTB_PIN7CTRL = 1591		// Pin 7 Control Register

;***************************************************************************
;** PORTC - Port C
;***************************************************************************
	
.equ PORTC_DIR = 1600		// I/O Port Data Direction
.equ PORTC_DIRSET = 1601		// I/O Port Data Direction Set
.equ PORTC_DIRCLR = 1602		// I/O Port Data Direction Clear
.equ PORTC_DIRTGL = 1603		// I/O Port Data Direction Toggle
.equ PORTC_OUT = 1604		// I/O Port Output
.equ PORTC_OUTSET = 1605		// I/O Port Output Set
.equ PORTC_OUTCLR = 1606		// I/O Port Output Clear
.equ PORTC_OUTTGL = 1607		// I/O Port Output Toggle
.equ PORTC_IN = 1608		// I/O port Input
.equ PORTC_INTCTRL = 1609		// Interrupt Control Register
.equ PORTC_INT0MASK = 1610		// Port Interrupt 0 Mask
.equ PORTC_INT1MASK = 1611		// Port Interrupt 1 Mask
.equ PORTC_INTFLAGS = 1612		// Interrupt Flag Register
.equ PORTC_REMAP = 1614		// I/O Port Pin Remap Register
.equ PORTC_PIN0CTRL = 1616		// Pin 0 Control Register
.equ PORTC_PIN1CTRL = 1617		// Pin 1 Control Register
.equ PORTC_PIN2CTRL = 1618		// Pin 2 Control Register
.equ PORTC_PIN3CTRL = 1619		// Pin 3 Control Register
.equ PORTC_PIN4CTRL = 1620		// Pin 4 Control Register
.equ PORTC_PIN5CTRL = 1621		// Pin 5 Control Register
.equ PORTC_PIN6CTRL = 1622		// Pin 6 Control Register
.equ PORTC_PIN7CTRL = 1623		// Pin 7 Control Register

;***************************************************************************
;** PORTD - Port D
;***************************************************************************
	
.equ PORTD_DIR = 1632		// I/O Port Data Direction
.equ PORTD_DIRSET = 1633		// I/O Port Data Direction Set
.equ PORTD_DIRCLR = 1634		// I/O Port Data Direction Clear
.equ PORTD_DIRTGL = 1635		// I/O Port Data Direction Toggle
.equ PORTD_OUT = 1636		// I/O Port Output
.equ PORTD_OUTSET = 1637		// I/O Port Output Set
.equ PORTD_OUTCLR = 1638		// I/O Port Output Clear
.equ PORTD_OUTTGL = 1639		// I/O Port Output Toggle
.equ PORTD_IN = 1640		// I/O port Input
.equ PORTD_INTCTRL = 1641		// Interrupt Control Register
.equ PORTD_INT0MASK = 1642		// Port Interrupt 0 Mask
.equ PORTD_INT1MASK = 1643		// Port Interrupt 1 Mask
.equ PORTD_INTFLAGS = 1644		// Interrupt Flag Register
.equ PORTD_REMAP = 1646		// I/O Port Pin Remap Register
.equ PORTD_PIN0CTRL = 1648		// Pin 0 Control Register
.equ PORTD_PIN1CTRL = 1649		// Pin 1 Control Register
.equ PORTD_PIN2CTRL = 1650		// Pin 2 Control Register
.equ PORTD_PIN3CTRL = 1651		// Pin 3 Control Register
.equ PORTD_PIN4CTRL = 1652		// Pin 4 Control Register
.equ PORTD_PIN5CTRL = 1653		// Pin 5 Control Register
.equ PORTD_PIN6CTRL = 1654		// Pin 6 Control Register
.equ PORTD_PIN7CTRL = 1655		// Pin 7 Control Register

;***************************************************************************
;** PORTE - Port E
;***************************************************************************
	
.equ PORTE_DIR = 1664		// I/O Port Data Direction
.equ PORTE_DIRSET = 1665		// I/O Port Data Direction Set
.equ PORTE_DIRCLR = 1666		// I/O Port Data Direction Clear
.equ PORTE_DIRTGL = 1667		// I/O Port Data Direction Toggle
.equ PORTE_OUT = 1668		// I/O Port Output
.equ PORTE_OUTSET = 1669		// I/O Port Output Set
.equ PORTE_OUTCLR = 1670		// I/O Port Output Clear
.equ PORTE_OUTTGL = 1671		// I/O Port Output Toggle
.equ PORTE_IN = 1672		// I/O port Input
.equ PORTE_INTCTRL = 1673		// Interrupt Control Register
.equ PORTE_INT0MASK = 1674		// Port Interrupt 0 Mask
.equ PORTE_INT1MASK = 1675		// Port Interrupt 1 Mask
.equ PORTE_INTFLAGS = 1676		// Interrupt Flag Register
.equ PORTE_REMAP = 1678		// I/O Port Pin Remap Register
.equ PORTE_PIN0CTRL = 1680		// Pin 0 Control Register
.equ PORTE_PIN1CTRL = 1681		// Pin 1 Control Register
.equ PORTE_PIN2CTRL = 1682		// Pin 2 Control Register
.equ PORTE_PIN3CTRL = 1683		// Pin 3 Control Register
.equ PORTE_PIN4CTRL = 1684		// Pin 4 Control Register
.equ PORTE_PIN5CTRL = 1685		// Pin 5 Control Register
.equ PORTE_PIN6CTRL = 1686		// Pin 6 Control Register
.equ PORTE_PIN7CTRL = 1687		// Pin 7 Control Register

;***************************************************************************
;** PORTF - Port F
;***************************************************************************
	
.equ PORTF_DIR = 1696		// I/O Port Data Direction
.equ PORTF_DIRSET = 1697		// I/O Port Data Direction Set
.equ PORTF_DIRCLR = 1698		// I/O Port Data Direction Clear
.equ PORTF_DIRTGL = 1699		// I/O Port Data Direction Toggle
.equ PORTF_OUT = 1700		// I/O Port Output
.equ PORTF_OUTSET = 1701		// I/O Port Output Set
.equ PORTF_OUTCLR = 1702		// I/O Port Output Clear
.equ PORTF_OUTTGL = 1703		// I/O Port Output Toggle
.equ PORTF_IN = 1704		// I/O port Input
.equ PORTF_INTCTRL = 1705		// Interrupt Control Register
.equ PORTF_INT0MASK = 1706		// Port Interrupt 0 Mask
.equ PORTF_INT1MASK = 1707		// Port Interrupt 1 Mask
.equ PORTF_INTFLAGS = 1708		// Interrupt Flag Register
.equ PORTF_REMAP = 1710		// I/O Port Pin Remap Register
.equ PORTF_PIN0CTRL = 1712		// Pin 0 Control Register
.equ PORTF_PIN1CTRL = 1713		// Pin 1 Control Register
.equ PORTF_PIN2CTRL = 1714		// Pin 2 Control Register
.equ PORTF_PIN3CTRL = 1715		// Pin 3 Control Register
.equ PORTF_PIN4CTRL = 1716		// Pin 4 Control Register
.equ PORTF_PIN5CTRL = 1717		// Pin 5 Control Register
.equ PORTF_PIN6CTRL = 1718		// Pin 6 Control Register
.equ PORTF_PIN7CTRL = 1719		// Pin 7 Control Register

;***************************************************************************
;** PORTH - Port H
;***************************************************************************
	
