trol73/avr-make/asm/include/ATxmega128A1Udef.inc
.equ HIRESE_CTRLA = 2704		// Control Register

;***************************************************************************
;** USARTE0 - Universal Asynchronous Receiver-Transmitter E0
;***************************************************************************
	
.equ USARTE0_DATA = 2720		// Data Register
.equ USARTE0_STATUS = 2721		// Status Register
.equ USARTE0_CTRLA = 2723		// Control Register A
.equ USARTE0_CTRLB = 2724		// Control Register B
.equ USARTE0_CTRLC = 2725		// Control Register C
.equ USARTE0_BAUDCTRLA = 2726		// Baud Rate Control Register A
.equ USARTE0_BAUDCTRLB = 2727		// Baud Rate Control Register B

;***************************************************************************
;** USARTE1 - Universal Asynchronous Receiver-Transmitter E1
;***************************************************************************
	
.equ USARTE1_DATA = 2736		// Data Register
.equ USARTE1_STATUS = 2737		// Status Register
.equ USARTE1_CTRLA = 2739		// Control Register A
.equ USARTE1_CTRLB = 2740		// Control Register B
.equ USARTE1_CTRLC = 2741		// Control Register C
.equ USARTE1_BAUDCTRLA = 2742		// Baud Rate Control Register A
.equ USARTE1_BAUDCTRLB = 2743		// Baud Rate Control Register B

;***************************************************************************
;** SPIE - Serial Peripheral Interface E
;***************************************************************************
	
.equ SPIE_CTRL = 2752		// Control Register
.equ SPIE_INTCTRL = 2753		// Interrupt Control Register
.equ SPIE_STATUS = 2754		// Status Register
.equ SPIE_DATA = 2755		// Data Register

;***************************************************************************
;** TCF0 - Timer/Counter F0
;***************************************************************************
	
.equ TCF0_CTRLA = 2816		// Control  Register A
.equ TCF0_CTRLB = 2817		// Control Register B
.equ TCF0_CTRLC = 2818		// Control register C
.equ TCF0_CTRLD = 2819		// Control Register D
.equ TCF0_CTRLE = 2820		// Control Register E
.equ TCF0_INTCTRLA = 2822		// Interrupt Control Register A
.equ TCF0_INTCTRLB = 2823		// Interrupt Control Register B
.equ TCF0_CTRLFCLR = 2824		// Control Register F Clear
.equ TCF0_CTRLFSET = 2825		// Control Register F Set
.equ TCF0_CTRLGCLR = 2826		// Control Register G Clear
.equ TCF0_CTRLGSET = 2827		// Control Register G Set
.equ TCF0_INTFLAGS = 2828		// Interrupt Flag Register
.equ TCF0_TEMP = 2831		// Temporary Register For 16-bit Access
.equ TCF0_CNT = 2848		// Count
.equ TCF0_PER = 2854		// Period
.equ TCF0_CCA = 2856		// Compare or Capture A
.equ TCF0_CCB = 2858		// Compare or Capture B
.equ TCF0_CCC = 2860		// Compare or Capture C
.equ TCF0_CCD = 2862		// Compare or Capture D
.equ TCF0_PERBUF = 2870		// Period Buffer
.equ TCF0_CCABUF = 2872		// Compare Or Capture A Buffer
.equ TCF0_CCBBUF = 2874		// Compare Or Capture B Buffer
.equ TCF0_CCCBUF = 2876		// Compare Or Capture C Buffer
.equ TCF0_CCDBUF = 2878		// Compare Or Capture D Buffer

;***************************************************************************
;** TCF2 - Timer/Counter F2
;***************************************************************************
	
.equ TCF2_CTRLA = 2816		// Control Register A
.equ TCF2_CTRLB = 2817		// Control Register B
.equ TCF2_CTRLC = 2818		// Control register C
.equ TCF2_CTRLE = 2820		// Control Register E
.equ TCF2_INTCTRLA = 2822		// Interrupt Control Register A
.equ TCF2_INTCTRLB = 2823		// Interrupt Control Register B
.equ TCF2_CTRLF = 2825		// Control Register F
.equ TCF2_INTFLAGS = 2828		// Interrupt Flag Register
.equ TCF2_LCNT = 2848		// Low Byte Count
.equ TCF2_HCNT = 2849		// High Byte Count
.equ TCF2_LPER = 2854		// Low Byte Period
.equ TCF2_HPER = 2855		// High Byte Period
.equ TCF2_LCMPA = 2856		// Low Byte Compare A
.equ TCF2_HCMPA = 2857		// High Byte Compare A
.equ TCF2_LCMPB = 2858		// Low Byte Compare B
.equ TCF2_HCMPB = 2859		// High Byte Compare B
.equ TCF2_LCMPC = 2860		// Low Byte Compare C
.equ TCF2_HCMPC = 2861		// High Byte Compare C
.equ TCF2_LCMPD = 2862		// Low Byte Compare D
.equ TCF2_HCMPD = 2863		// High Byte Compare D

;***************************************************************************
;** TCF1 - Timer/Counter F1
;***************************************************************************
	
.equ TCF1_CTRLA = 2880		// Control  Register A
.equ TCF1_CTRLB = 2881		// Control Register B
.equ TCF1_CTRLC = 2882		// Control register C
.equ TCF1_CTRLD = 2883		// Control Register D
.equ TCF1_CTRLE = 2884		// Control Register E
.equ TCF1_INTCTRLA = 2886		// Interrupt Control Register A
.equ TCF1_INTCTRLB = 2887		// Interrupt Control Register B
.equ TCF1_CTRLFCLR = 2888		// Control Register F Clear
.equ TCF1_CTRLFSET = 2889		// Control Register F Set
.equ TCF1_CTRLGCLR = 2890		// Control Register G Clear
.equ TCF1_CTRLGSET = 2891		// Control Register G Set
.equ TCF1_INTFLAGS = 2892		// Interrupt Flag Register
.equ TCF1_TEMP = 2895		// Temporary Register For 16-bit Access
.equ TCF1_CNT = 2912		// Count
.equ TCF1_PER = 2918		// Period
.equ TCF1_CCA = 2920		// Compare or Capture A
.equ TCF1_CCB = 2922		// Compare or Capture B
.equ TCF1_PERBUF = 2934		// Period Buffer
.equ TCF1_CCABUF = 2936		// Compare Or Capture A Buffer
.equ TCF1_CCBBUF = 2938		// Compare Or Capture B Buffer

;***************************************************************************
;** HIRESF - High-Resolution Extension F
;***************************************************************************
	
.equ HIRESF_CTRLA = 2960		// Control Register

;***************************************************************************
;** USARTF0 - Universal Asynchronous Receiver-Transmitter F0
;***************************************************************************
	
.equ USARTF0_DATA = 2976		// Data Register
.equ USARTF0_STATUS = 2977		// Status Register
.equ USARTF0_CTRLA = 2979		// Control Register A
.equ USARTF0_CTRLB = 2980		// Control Register B
.equ USARTF0_CTRLC = 2981		// Control Register C
.equ USARTF0_BAUDCTRLA = 2982		// Baud Rate Control Register A
.equ USARTF0_BAUDCTRLB = 2983		// Baud Rate Control Register B

;***************************************************************************
;** USARTF1 - Universal Asynchronous Receiver-Transmitter F1
;***************************************************************************
	
.equ USARTF1_DATA = 2992		// Data Register
.equ USARTF1_STATUS = 2993		// Status Register
.equ USARTF1_CTRLA = 2995		// Control Register A
.equ USARTF1_CTRLB = 2996		// Control Register B
.equ USARTF1_CTRLC = 2997		// Control Register C
.equ USARTF1_BAUDCTRLA = 2998		// Baud Rate Control Register A
.equ USARTF1_BAUDCTRLB = 2999		// Baud Rate Control Register B

;***************************************************************************
;** SPIF - Serial Peripheral Interface F
;***************************************************************************
	
.equ SPIF_CTRL = 3008		// Control Register
.equ SPIF_INTCTRL = 3009		// Interrupt Control Register
.equ SPIF_STATUS = 3010		// Status Register
.equ SPIF_DATA = 3011		// Data Register


; ***** ALL MODULE BASE ADRESSES *****************************************

.equ GPIO_base = 0x0000		// General Purpose IO Registers
.equ VPORT0_base = 0x0010		// Virtual Port 0
.equ VPORT1_base = 0x0014		// Virtual Port 1
.equ VPORT2_base = 0x0018		// Virtual Port 2
.equ VPORT3_base = 0x001C		// Virtual Port 3
.equ OCD_base = 0x002E		// On-Chip Debug System
.equ CPU_base = 0x0030		// CPU Registers
.equ CLK_base = 0x0040		// Clock System
.equ SLEEP_base = 0x0048		// Sleep Controller
.equ OSC_base = 0x0050		// Oscillator Control
.equ DFLLRC32M_base = 0x0060		// DFLL for 32MHz RC Oscillator
.equ DFLLRC2M_base = 0x0068		// DFLL for 2MHz RC Oscillator
.equ PR_base = 0x0070		// Power Reduction
.equ RST_base = 0x0078		// Reset Controller
.equ WDT_base = 0x0080		// Watch-Dog Timer
.equ MCU_base = 0x0090		// MCU Control
.equ PMIC_base = 0x00A0		// Programmable Interrupt Controller
.equ PORTCFG_base = 0x00B0		// Port Configuration
.equ AES_base = 0x0C0		// AES Crypto Module
.equ CRC_base = 0x0D0		// CRC Module
.equ DMA_base = 0x0100		// DMA Controller
.equ EVSYS_base = 0x0180		// Event System
.equ NVM_base = 0x01C0		// Non Volatile Memory Controller
.equ ADCA_base = 0x0200		// Analog to Digital Converter A
.equ ADCB_base = 0x0240		// Analog to Digital Converter B
.equ DACA_base = 0x0300		// Digital to Analog Converter A
.equ DACB_base = 0x0320		// Digital to Analog Converter B
.equ ACA_base = 0x0380		// Analog Comparator A
.equ ACB_base = 0x0390		// Analog Comparator B
.equ RTC_base = 0x0400		// Real-Time Counter
.equ EBI_base = 0x0440		// External Bus Interface
.equ TWIC_base = 0x480		// Two-Wire Interface C
.equ TWID_base = 0x490		// Two-Wire Interface D
.equ TWIE_base = 0x4A0		// Two-Wire Interface E
.equ TWIF_base = 0x4B0		// Two-Wire Interface F
.equ USB_base = 0x4C0		// Universal Serial Bus
.equ PORTA_base = 0x0600		// Port A
.equ PORTB_base = 0x0620		// Port B
.equ PORTC_base = 0x0640		// Port C
.equ PORTD_base = 0x0660		// Port D
.equ PORTE_base = 0x0680		// Port E
.equ PORTF_base = 0x06A0		// Port F
.equ PORTH_base = 0x06E0		// Port H
.equ PORTJ_base = 0x0700		// Port J
.equ PORTK_base = 0x0720		// Port K
.equ PORTQ_base = 0x07C0		// Port Q
.equ PORTR_base = 0x07E0		// Port R
.equ TCC0_base = 0x800		// Timer/Counter C0
.equ TCC2_base = 0x800		// Timer/Counter C2
.equ TCC1_base = 0x840		// Timer/Counter C1
.equ AWEXC_base = 0x880		// Advanced Waveform Extension C
.equ HIRESC_base = 0x890		// High-Resolution Extension C
.equ USARTC0_base = 0x8A0		// Universal Asynchronous Receiver-Transmitter C0
.equ USARTC1_base = 0x8B0		// Universal Asynchronous Receiver-Transmitter C1
.equ SPIC_base = 0x8C0		// Serial Peripheral Interface C
.equ IRCOM_base = 0x8F8		// IR Communication Module
.equ TCD0_base = 0x900		// Timer/Counter D0
.equ TCD2_base = 0x900		// Timer/Counter D2
.equ TCD1_base = 0x940		// Timer/Counter D1
.equ HIRESD_base = 0x990		// High-Resolution Extension D
.equ USARTD0_base = 0x9A0		// Universal Asynchronous Receiver-Transmitter D0
.equ USARTD1_base = 0x9B0		// Universal Asynchronous Receiver-Transmitter D1
.equ SPID_base = 0x9C0		// Serial Peripheral Interface D
.equ TCE0_base = 0xA00		// Timer/Counter E0
.equ TCE2_base = 0xA00		// Timer/Counter E2
.equ TCE1_base = 0xA40		// Timer/Counter E1
.equ AWEXE_base = 0xA80		// Advanced Waveform Extension E
.equ HIRESE_base = 0xA90		// High-Resolution Extension E
.equ USARTE0_base = 0xAA0		// Universal Asynchronous Receiver-Transmitter E0
.equ USARTE1_base = 0xAB0		// Universal Asynchronous Receiver-Transmitter E1
.equ SPIE_base = 0xAC0		// Serial Peripheral Interface E
.equ TCF0_base = 0xB00		// Timer/Counter F0
.equ TCF2_base = 0xB00		// Timer/Counter F2
.equ TCF1_base = 0xB40		// Timer/Counter F1
.equ HIRESF_base = 0xB90		// High-Resolution Extension F
.equ USARTF0_base = 0xBA0		// Universal Asynchronous Receiver-Transmitter F0
.equ USARTF1_base = 0xBB0		// Universal Asynchronous Receiver-Transmitter F1
.equ SPIF_base = 0xBC0		// Serial Peripheral Interface F


